// let [a,b,c] =  [1,2,3]
// let { x, y, z } = { "x": 1, "y": 2, "z": 3}
// let [a, b, c] = [1, { "x": 1, "y": 2, "z": 3 }, 3]
let [a, b, { x, y, z }, c] = [1, { "x1": 1, "y2": 2, "z3": 3 }, { "x": 1, "y": 2, "z": 3 }, 3]

console.log('====================================');
console.log(a + '===' + b + '===' + c);
console.log('原因：字符串+将调用toString()函数将对象专为字符串了，所以不能展开详情');
console.log(b);
console.log('====================================');
console.log(x + '===' + y + '===' + z);
console.log('====================================');
